{"Id":160,"Description":"Suggest treatment for pneumonia\r\n\r\n","DialogueText":"Patient:\r\nI have had a Percocet addiction for 35 years and have had many Dr.s in that time span. I was up to without exaggeration, eating 240 10mg p s, 98 30mg oxycodone pills, as well as an assortment of 5mg pills which were always at my disposal. I have cancer and have severe back injuries but along with the p s I also had monthly access to 240 2mg xannax pills which after awhile Ihad no problem eating all of the above each month and would look for some more. I died 4 times in a 6 year span due to double pneumonia which the Dr.s told me my medications were playing a large roll in this. When I was 16 I became an atheist due to my brother dying, he was my favorite and I became very drug dependent to kill the pain. This lead to my later addictions and no matter what I tried I could not escape their grip.The last time I was in the hospital I said Lord I do not know if you are real but if you are I am begging you to open my heart again to you and I need your help or this will probably be it for me when I leave the hospital, I have had enough, and this is only the drug portion of my life I would not wish the things and amount of death I have had to witness on anyone. I am the last of all my friends left alive and I am 53years old. Over 40 friends have passed on, 2 of which I grew up with from the age of 5, others just would not listen. I lost 2 older brothers, 1 my 1st year in highschool the other 8 years later of an overdose. Needless to say ptsd, depression and other problems haunted me until I did as many drugs as possible to bury the pain, but demons only stay buried so long which I found out the hard way. tiny2882@comcat,net\r\nDoctor:\r\nRespected user, hi I evaluated whole long query in total details thoroughly .* Now only options left for you is holistic healing with herbs \u0026 other things.* Current respiratory details \u0026 status are not mentioned with symptoms to   figure out for the pneumonia, but for mental condition I can say that only   \u0026 only thing which can help you to any extent is   very deep meditation sessions on highly regular basis   2-3 hours of dedicated YOGA daily    which will give your inner soul \u0026 subcouncious mind the level of peace   you are lacking at present .Hope this helps you .Welcome for any further assistance .Thanks  for using Healthcaremagic.com \u0026 giving me an opportunity to assistWishing you a healthy life ahead .Regards dear take care.\r\n\r\n"}