{"Id":157,"Description":"What causes severe cough, shoulder blade pain and heart palpitations while treating pneumonia?\r\n\r\n","DialogueText":"Patient:\r\nI have a pneumonia and have gone through 1 full round of a zpack and steroid. I m also using an inhaler, had to go back to dog on Thursday night because I was still not any better. They gave me a antibiotic shot and a 1/10day script for levaquin which I started about 10am Friday morning. I m still not feeling better. I now as of this morning have a sharp pain inbetween shoulder blades that comes and goes, my heart flutters sometimes and sometimes beats really fast, I also woke up to chest pain that would go from burning feeling to sharp pain for about 30 min consecutively, then stopped and has been on and off since then. My cough is so bad that when I cough it feels like my ribs/lower sides of my back/lung area are bruised/fractured and takes my breath away when I take deap breathes or bend my waiste. I noticed bout a 5 days ago that I would get really hot at random times. Ao thinking i was having a fever, I ve been keeping track daily of my bt as of about 3/4 days ago and it s seems to have steadily slowly dropped. It s ranging usually from 96-97 but sometimes it ll get to like 98.0 and thats while I m sweating so bad that s my shirt will be soaked and hair wet like I was standing outside in the sun for an hr in middle of summer. It s sick. Should I be worried?\r\nDoctor:\r\nRespected user , hi Thanks for using Healthcaremagic.comI have evaluated your query thoroughly .* All symptoms are in relation with underlying lung condition giving rise to   broncho alveolar constrictions , pleura irritation with systemic    manifestations* As there is not much relief of oral medications given till now , I strongly   recommend to get hospitalised treatment \u0026 early better recovery through   IV antibiotics , bronchodilators, supportive nursing care Hope this clears your queryWelcome for any further assistance Regards .\r\n\r\n"}