{"Id":54,"Description":"Suggest medication for severe pneumonia\r\n\r\n","DialogueText":"Patient:\r\nI have been on methadone for approx. 5 years now at a dose of 30mg taken 4 times daily. This has not only stopped any unpleasant withdrawl symptoms but has also offered considerable relief in easing chronic pain from a severe back injury 11 years ago. For the first 3 years of taking the medication I found that while it was effective in these areas their was an exceptional side effect in that it absolutely obliterated any interest in sex or even the ability to physically have sex. Also I found that I had next to no energy, making many things I used to enjoy fall by the wayside which in turn led to severe depression. After extensive talks with my Doctor I was sent for blood analysis and it was found that my level of testosterone was so low it barely registered. I was then put on a 3 week cycle of injections of 2mls of Delatestryl and for the past several years I have been the person that I used to be (it gave me my life back). Know I have been given a new Doctor at the clinic I attend and he has informed me that he is only there to prescribe methadone and will not be responsible for any other prescriptions. I do not have a family doctor and our emerg has said that this falls outside their domain. The walk in clinic treats every individual that I know so badly that their is no doubt in my mind that they will refuse to continue this presciption. (to give you some perspective on our walk in clinic - I went their several mnths back with sever pneumonia and the Doctor looked at my chart once and told me that I would get know %$# narcotics from him and to leave immediately) Any suggestions on how to get across to my knew methadone Doctor (who has only been in prescribing methadone for 2 months) just how much this would severely negatively impact my life?\r\nDoctor:\r\nHello and Welcome to ‘Ask A Doctor’ service. \r\nI have reviewed your query and here is my advice.\r\n * The pneumonia management depends upon the symptoms which are not narrated here precisely.\r\n* The Methadone is known to cause long terms side effects over liver, kidney and other body systems, which should be discussed with the   treating physician.\r\n Awaiting for the symptomatic details to guide further.\r\n Hope I have answered your query. Let me know if I can assist you further.\r\n\r\n"}