{"Id":109,"Description":"Can cough lead to pneumonia or tuberculosis?\r\n\r\n","DialogueText":"Patient:\r\nNAME: Brent\r\nAGE: 22\r\nSEX: Male\r\nSYMPTOMS : \r\nI have a cough that seems to be reccursive. It occurs usually at nightime, or if I gave a very intense sneeze or laugh. When this cough occurs, it is very dry, that it would sound like a yelping dog. \r\n Also, besides cough, I do experience a reccursive runny nose, sometimes coupled with watery red eyes and itchy throat. The runny nose discharge is transparent, almost like saliva or tears. Ironically, after a while, these symptoms would disappear, and when they do disappear, I feel completely normal.\r\n  I have already consulted a doctor and was diagnosed of allergic rhinits. She adviced me to take anti histamines, either zirtec or iterax, which ever do i prefer. Unfortunately, it works at often but not at all times. \r\nHOW MANY DAYS?:Reccursive cough has been going on since april of this year. As for the runny nose, since november of last year\r\n ALLERGIES: not that i know of,\r\n When I was five years old, I remember being diagnosed of Primary Complex, but was able to be treated before it goes into something else. \r\n Also, TB runs in the family, as my uncle had it before, and so as my mom (although the doctor said it was already a scar). \r\n As for me, 2009 was a stressful year. There were months, when my hours of daily sleep was only around 3 to four hours due to school work. Also, for a period of time I was involved in smoking, although it has been a month since I stopped.\r\n Doctor, I would just like to know what are the chances of me, acquiring respiratory illness like pneumonia or tuberculosis, or development of asthma? Also, if i get to consult a doctor personally with my parents, will the doctor be able to detect my past smoking habit, based on the procedures he will do, or with tests that he will recommend like xray? The truth is, I am hesitant to go to a medical clinic, because my parents have to accompany me, and I am afraid that the doctor might make \u0022bisto\u0022  towards my parents, as they don\u0027t know that I do smoke. \r\n But i do really want to seek medical attention. Besides the incovenicence of symtpoms, I am worried that it might be something serious. \r\n Hoping for a  share of your brilliant expertise.\r\n thank you doctor and good day.\r\nDoctor:\r\nThanks for your concern. The dry cough basically has a few causes....First is Post nasal drip, second  Gastroesophageal reflux\u0027heart burn\u0027, third Cough variant aasthma, forth Heart failure and finally Interstitial lung disease. Based on the information if you don\u0027t have a heart burn or reflux of food or sour brash into your mouth, you are having a cough variant asthma, make sure you do not have difficulty breathing. There is something called cardiac asthma, but it\u0027s not much of a likelihood given your young age.I advice you that you give up on smoking as it causes a multitude of problems and may well be related to the cough you\u0027ve been having now called as \u0027smokers cough\u0027.It\u0027s time that you stop smoking, avoid animal dancers, mites, pollens and any thing that would exacerbate the illness, make sure you don\u0027t have a heart burn, and if still the cough persists , meet a pulmo neologism and get a Pulmonary function test with methacholine challenge\r\n\r\n"}