{"Id":159,"Description":"Which is the best exercise in year following treatment with levofloxacin for pneumonia?\r\n\r\n","DialogueText":"Patient:\r\nWhat is the advisability of exercise in the year following treatment with Levofloxaxin for pneumonia? I just completed 5 days of treatment with pills after 4 or more days of IV in the hospital following gall bladder surgery. I entered the hospital with pneumonia (not knowing I had it), probably having contracted it from my brother who had it and whom I had visited several days earlier in another hospital. I am 71 years old, female; I had a non-heart damaging heart attack in 2003 and have tried to maintain a good exercise program to lessen my chances of worsening heart disease. Should I resume Naproxen for joint/muscle pain; had 2 doses (2 tablets twice daily) 2 days before hospitalization. Did not need it the 3rd day and was hospitalized the next day. Did not take it post hospitalization. Do not remember if they gave it in hospital; think not. Thank you.\r\nDoctor:\r\nHello welcome to HCM. I have gone through your history. You have been adequately treated for your pneumonia and I suppose you don\u0027t have any symptoms of pneumonia like cough, fast breathing, fever, breathlessness. Since you have received intravenous plus 5 days of oral antibiotics, now you can resume about your exercise regime. As you say you had a non damaging heart attack, means that your heart pumping function is well preserved. So you must not have any issues with exercise. With every lung infection the lung capacity decreases by some percentage proportional to he severity of the infection. Hence along with your routine exercises you must also undergo breathing exercises with incentive spirometry, inhaling deeply through one nose holding your breath and exhaling fully from the other nose, meditation and yoga. This will help you to regain some of the lost lung capacity. You should also get vaccinated with influenza and pneumonia vaccines that include common strains which cause pneumonia Remember they don\u0027t protect you against all pneumonias but offer protection against common pneumonias.Regarding Naproxen too much of it may cause damage to your kidneys so I advice you decrease its usage and use it only when required rather than a daily basis.Wishing you good health. Regards\r\n\r\n"}